Revit 2027 API
StructuralConnectionHandler.SetDefaultElementOrder Method
 Sorts the connected elements connection according to structural categories, element materials and geometries. The steel element is set rather than an element of other material. The priorities of the elements are set according structural categories in following order: columns, framings, walls, foundations, floors. In case of several Structural Framing elements order is determined by cutting - the cutting element is set as the primary one rather than element being cut.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDefaultElementOrder()
Public Sub SetDefaultElementOrder
public:
void SetDefaultElementOrder()
member SetDefaultElementOrder : unit -> unit
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace